{
  "name": "Reilley Gray",
  "location": "Melbourne, Victoria",
  "phoneNumber": "+61 435 887 041",
  "email": "reilleygray@gmail.com",
  "website": "linkedin.com/in/reilley-gray/",
  "description": "Software Developer with over four years of experience in fullstack development. Expertise in Java and JavaScript, and a proficiency in React.js for front-end development. Committed to delivering innovative solutions and continuously expanding my skill set. Ready to contribute to your team's success through collaborative efforts.",
  "skills": [
    {
      "heading": "Frontend",
      "items": [
        "Javascript",
        "Node.js",
        "Typescript",
        "React.js",
        "Vue.js",
        "HTML",
        "CSS"
      ]
    },
    {
      "heading": "Backend",
      "items": [
        "Java",
        "EJB",
        "Spring Boot",
        "Ruby",
        "Ruby on Rails",
        "Python",
        "Django",
        "PHP",
        "SQL",
        "MySQL",
        "PostgreSQL"
      ]
    },
    {
      "heading": "Infrastructure",
      "items": [
        "Amazon Web Services (EC2, ECS, RDS, Lambda, Cognito, S3, Amplify and SQS)",
        "Google Cloud Platform",
        "Docker",
        "Docker Compose",
        "Git"
      ]
    }
  ],
  "experience": [
    {
      "company": "CapitalRoad Industries",
      "position": "Software Developer",
      "startDate": "May 2019",
      "endDate": "Oct 2023",
      "description": [
        "Initially joined as a contract worker, focused on establishing a test framework for a Java EJB\nmonolithic REST API supporting a financial tech SaaS product.",
        "Transitioned to a full-time software developer role in December 2019, specializing in frontend\ndevelopment within a React.js project for the same SaaS product.",
        "Led successful migration of the React.js project from class-based to hook-based architecture,\nimproving code maintainability and performance.",
        "Demonstrated commitment to staying current with emerging technologies, consistently\nupdating and maintaining the project's technology stack.",
        "Contributed to building Java Spring Boot microservices, enhancing system modularity and\nscalability.",
        "Exhibited strong client-facing skills, actively engaging with clients and delivering tailored\nsolutions.",
        "Spearheaded a project towards the end of my employment, showcasing leadership and autonomy\nin delivering cutting-edge solutions using React.js and Spring Boot technologies to build a\nclient-specific extension for our main SaaS product."
      ]
    }
  ],
  "education": [
    {
      "institution": "Royal Melbourne Institute of Technology",
      "degree": "Bachelor of Technology (Computing Studies)",
      "startDate": "2017",
      "endDate": "2019",
      "description": [
        "Opted for a purposeful leave of absence from university, I directed my focus towards career\nopportunities at CapitalRoad",
        "While honing my expertise in programming languages like Java, Ruby, Python, and JavaScript, I\nconcurrently acquired valuable insights into agile project management methodologies.",
        "My proficiency in Ruby and Vue.js, particularly, was cultivated through my capstone project, a\nfinancial tech SaaS product, showcasing practical application and hands-on experience.",
        "Additionally, I pursued a minor in business, broadening my knowledge and skills to complement\nmy technical background."
      ]
    },
    {
      "institution": "Lakeview Senior College",
      "degree": "Certificate III in Business",
      "startDate": "2014",
      "endDate": "2014",
      "description": "I completed my Certificate III in Business at Lakeview Senior College, where I delved into fundamental business practices. Through this program, I gained proficiency in essential skills such as spreadsheet production, the application of workplace health and safety (WHS) legislation, and effective organization of personal work priorities and development. These valuable insights not only expanded my knowledge in business operations but also equipped me with practical skills that have proven to be invaluable in my career pursuits"
    }
  ]
}